CSI API ETABS v1
cDCoACI318_08_IBC2009.SetPreference Method
 Sets the value of a concrete design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDCoACI318_08_IBC2009
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 13, inclusive, indicating the preference item considered.
Number of interaction curves
Number of interaction points
Consider minimum eccentricity
Seismic design category
Phi tension controlled
Phi compression controlled tied
Phi compression controlled spiral
Phi shear and/or torsion
Phi shear seismic
Phi joint shear
Pattern live load factor
Utilization factor limit
Multi-response case design
Value
Type: System.Double
 The value of the considered preference item.
 Number of interaction curves
 Value >= 4 and divisable by 4
 Number of interaction points
 Value >= 5 and odd
 Consider minimum eccentricity
 0 = No
 Any other value = Yes
 Seismic design category
1 = A
2 = B
3 = C
4 = D
5 = E
6 = F
 Phi tension controlled
 Value > 0
 Phi compression controlled tied
 Value > 0
 Phi compression controlled spiral
 Value > 0
 Phi shear and/or torsion
 Value > 0
 Phi shear seismic
 Value > 0
 Phi joint shear
 Value > 0
 Pattern live load factor
 Value >= 0
 Utilization factor limit
 Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by step
3 = Last step
4 = Envelopes - All
5 = Step-by step - All
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("ACI 318-08/IBC 2009")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'set preference item
   ret = SapModel.DesignConcrete.ACI318_08_IBC2009.SetPreference(2, 9)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoACI318_08_IBC2009 Interface
ETABSv1 Namespace